MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K50/mcu.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0xFB3);
#ifndef _LIB_BUILD
asm("TMR3H equ 0FB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3H                  :8;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0xFB3);
// bitfield macros
#define _TMR3H_TMR3H_POSN                                   0x0
#define _TMR3H_TMR3H_POSITION                               0x0
#define _TMR3H_TMR3H_SIZE                                   0x8
#define _TMR3H_TMR3H_LENGTH                                 0x8
#define _TMR3H_TMR3H_MASK                                   0xFF

// Register: T3GCON
#define T3GCON T3GCON
extern volatile unsigned char           T3GCON              __at(0xFB4);
#ifndef _LIB_BUILD
asm("T3GCON equ 0FB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned T3GGO_NOT_T3DONE       :1;
    };
    struct {
        unsigned T3GSS                  :2;
        unsigned T3GVAL                 :1;
        unsigned T3GGO_nT3DONE          :1;
        unsigned T3GSPM                 :1;
        unsigned T3GTM                  :1;
        unsigned T3GPOL                 :1;
        unsigned TMR3GE                 :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned                        :1;
        unsigned T3GGO                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_T3DONE             :1;
    };
    struct {
        unsigned                        :3;
        unsigned nT3DONE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3DONE                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :3;
        unsigned T3GGO_nDONE            :1;
    };
} T3GCONbits_t;
extern volatile T3GCONbits_t T3GCONbits __at(0xFB4);
// bitfield macros
#define _T3GCON_T3GGO_NOT_T3DONE_POSN                       0x3
#define _T3GCON_T3GGO_NOT_T3DONE_POSITION                   0x3
#define _T3GCON_T3GGO_NOT_T3DONE_SIZE                       0x1
#define _T3GCON_T3GGO_NOT_T3DONE_LENGTH                     0x1
#define _T3GCON_T3GGO_NOT_T3DONE_MASK                       0x8
#define _T3GCON_T3GSS_POSN                                  0x0
#define _T3GCON_T3GSS_POSITION                              0x0
#define _T3GCON_T3GSS_SIZE                                  0x2
#define _T3GCON_T3GSS_LENGTH                                0x2
#define _T3GCON_T3GSS_MASK                                  0x3
#define _T3GCON_T3GVAL_POSN                                 0x2
#define _T3GCON_T3GVAL_POSITION                             0x2
#define _T3GCON_T3GVAL_SIZE                                 0x1
#define _T3GCON_T3GVAL_LENGTH                               0x1
#define _T3GCON_T3GVAL_MASK                                 0x4
#define _T3GCON_T3GGO_nT3DONE_POSN                          0x3
#define _T3GCON_T3GGO_nT3DONE_POSITION                      0x3
#define _T3GCON_T3GGO_nT3DONE_SIZE                          0x1
#define _T3GCON_T3GGO_nT3DONE_LENGTH                        0x1
#define _T3GCON_T3GGO_nT3DONE_MASK                          0x8
#define _T3GCON_T3GSPM_POSN                                 0x4
#define _T3GCON_T3GSPM_POSITION                             0x4
#define _T3GCON_T3GSPM_SIZE                                 0x1
#define _T3GCON_T3GSPM_LENGTH                               0x1
#define _T3GCON_T3GSPM_MASK                                 0x10
#define _T3GCON_T3GTM_POSN                                  0x5
#define _T3GCON_T3GTM_POSITION                              0x5
#define _T3GCON_T3GTM_SIZE                                  0x1
#define _T3GCON_T3GTM_LENGTH                                0x1
#define _T3GCON_T3GTM_MASK                                  0x20
#define _T3GCON_T3GPOL_POSN                                 0x6
#define _T3GCON_T3GPOL_POSITION                             0x6
#define _T3GCON_T3GPOL_SIZE                                 0x1
#define _T3GCON_T3GPOL_LENGTH                               0x1
#define _T3GCON_T3GPOL_MASK                                 0x40
#define _T3GCON_TMR3GE_POSN                                 0x7
#define _T3GCON_TMR3GE_POSITION                             0x7
#define _T3GCON_TMR3GE_SIZE                                 0x1
#define _T3GCON_TMR3GE_LENGTH                               0x1
#define _T3GCON_TMR3GE_MASK                                 0x80
#define _T3GCON_T3GSS0_POSN                                 0x0
#define _T3GCON_T3GSS0_POSITION                             0x0
#define _T3GCON_T3GSS0_SIZE                                 0x1
#define _T3GCON_T3GSS0_LENGTH                               0x1
#define _T3GCON_T3GSS0_MASK                                 0x1
#define _T3GCON_T3GSS1_POSN                                 0x1
#define _T3GCON_T3GSS1_POSITION                             0x1
#define _T3GCON_T3GSS1_SIZE                                 0x1
#define _T3GCON_T3GSS1_LENGTH                               0x1
#define _T3GCON_T3GSS1_MASK                                 0x2
#define _T3GCON_T3GGO_POSN                                  0x3
#define _T3GCON_T3GGO_POSITION                              0x3
#define _T3GCON_T3GGO_SIZE                                  0x1
#define _T3GCON_T3GGO_LENGTH                                0x1
#define _T3GCON_T3GGO_MASK                                  0x8
#define _T3GCON_NOT_T3DONE_POSN                             0x3
#define _T3GCON_NOT_T3DONE_POSITION                         0x3
#define _T3GCON_NOT_T3DONE_SIZE                             0x1
#define _T3GCON_NOT_T3DONE_LENGTH                           0x1
#define _T3GCON_NOT_T3DONE_MASK                             0x8
#define _T3GCON_nT3DONE_POSN                                0x3
#define _T3GCON_nT3DONE_POSITION                            0x3
#define _T3GCON_nT3DONE_SIZE                                0x1
#define _T3GCON_nT3DONE_LENGTH                              0x1
#define _T3GCON_nT3DONE_MASK                                0x8
#define _T3GCON_T3DONE_POSN                                 0x3
#define _T3GCON_T3DONE_POSITION                             0x3
#define _T3GCON_T3DONE_SIZE                                 0x1
#define _T3GCON_T3DONE_LENGTH                               0x1
#define _T3GCON_T3DONE_MASK                                 0x8
#define _T3GCON_T3GGO_NOT_DONE_POSN                         0x3
#define _T3GCON_T3GGO_NOT_DONE_POSITION                     0x3
#define _T3GCON_T3GGO_NOT_DONE_SIZE                         0x1
#define _T3GCON_T3GGO_NOT_DONE_LENGTH                       0x1
#define _T3GCON_T3GGO_NOT_DONE_MASK                         0x8
#define _T3GCON_T3GGO_nDONE_POSN                            0x3
#define _T3GCON_T3GGO_nDONE_POSITION                        0x3
#define _T3GCON_T3GGO_nDONE_SIZE                            0x1
#define _T3GCON_T3GGO_nDONE_LENGTH                          0x1
#define _T3GCON_T3GGO_nDONE_MASK                            0x8

// Register: ACTCON
#define ACTCON ACTCON
extern volatile unsigned char           ACTCON              __at(0xFB5);
#ifndef _LIB_BUILD
asm("ACTCON equ 0FB5h");
#endif
// aliases
extern volatile unsigned char           STCON               __at(0xFB5);
#ifndef _LIB_BUILD
asm("STCON equ 0FB5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ACTORS                 :1;
        unsigned                        :1;
        unsigned ACTLOCK                :1;
        unsigned ACTSRC                 :1;
        unsigned                        :1;
        unsigned ACTUD                  :1;
        unsigned ACTEN                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned STOR                   :1;
        unsigned                        :1;
        unsigned STLOCK                 :1;
        unsigned STSRC                  :1;
        unsigned                        :1;
        unsigned STUD                   :1;
        unsigned STEN                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned ACTOR                  :1;
        unsigned                        :4;
        unsigned ACTD                   :1;
        unsigned ACTSEL                 :1;
    };
} ACTCONbits_t;
extern volatile ACTCONbits_t ACTCONbits __at(0xFB5);
// bitfield macros
#define _ACTCON_ACTORS_POSN                                 0x1
#define _ACTCON_ACTORS_POSITION                             0x1
#define _ACTCON_ACTORS_SIZE                                 0x1
#define _ACTCON_ACTORS_LENGTH                               0x1
#define _ACTCON_ACTORS_MASK                                 0x2
#define _ACTCON_ACTLOCK_POSN                                0x3
#define _ACTCON_ACTLOCK_POSITION                            0x3
#define _ACTCON_ACTLOCK_SIZE                                0x1
#define _ACTCON_ACTLOCK_LENGTH                              0x1
#define _ACTCON_ACTLOCK_MASK                                0x8
#define _ACTCON_ACTSRC_POSN                                 0x4
#define _ACTCON_ACTSRC_POSITION                             0x4
#define _ACTCON_ACTSRC_SIZE                                 0x1
#define _ACTCON_ACTSRC_LENGTH                               0x1
#define _ACTCON_ACTSRC_MASK                                 0x10
#define _ACTCON_ACTUD_POSN                                  0x6
#define _ACTCON_ACTUD_POSITION                              0x6
#define _ACTCON_ACTUD_SIZE                                  0x1
#define _ACTCON_ACTUD_LENGTH                                0x1
#define _ACTCON_ACTUD_MASK                                  0x40
#define _ACTCON_ACTEN_POSN                                  0x7
#define _ACTCON_ACTEN_POSITION                              0x7
#define _ACTCON_ACTEN_SIZE                                  0x1
#define _ACTCON_ACTEN_LENGTH                                0x1
#define _ACTCON_ACTEN_MASK                                  0x80
#define _ACTCON_STOR_POSN                                   0x1
#define _ACTCON_STOR_POSITION                               0x1
#define _ACTCON_STOR_SIZE                                   0x1
#define _ACTCON_STOR_LENGTH                                 0x1
#define _ACTCON_STOR_MASK                                   0x2
#define _ACTCON_STLOCK_POSN                                 0x3
#define _ACTCON_STLOCK_POSITION                             0x3
#define _ACTCON_STLOCK_SIZE                                 0x1
#define _ACTCON_STLOCK_LENGTH                               0x1
#define _ACTCON_STLOCK_MASK                                 0x8
#define _ACTCON_STSRC_POSN                                  0x4
#define _ACTCON_STSRC_POSITION                              0x4
#define _ACTCON_STSRC_SIZE                                  0x1
#define _ACTCON_STSRC_LENGTH                                0x1
#define _ACTCON_STSRC_MASK                                  0x10
#define _ACTCON_STUD_POSN                                   0x6
#define _ACTCON_STUD_POSITION                               0x6
#define _ACTCON_STUD_SIZE                                   0x1
#define _ACTCON_STUD_LENGTH                                 0x1
#define _ACTCON_STUD_MASK                                   0x40
#define _ACTCON_STEN_POSN                                   0x7
#define _ACTCON_STEN_POSITION                               0x7
#define _ACTCON_STEN_SIZE                                   0x1
#define _ACTCON_STEN_LENGTH                                 0x1
#define _ACTCON_STEN_MASK                                   0x80
#define _ACTCON_ACTOR_POSN                                  0x1
#define _ACTCON_ACTOR_POSITION                              0x1
#define _ACTCON_ACTOR_SIZE                                  0x1
#define _ACTCON_ACTOR_LENGTH                                0x1
#define _ACTCON_ACTOR_MASK                                  0x2
#define _ACTCON_ACTD_POSN                                   0x6
#define _ACTCON_ACTD_POSITION                               0x6
#define _ACTCON_ACTD_SIZE                                   0x1
#define _ACTCON_ACTD_LENGTH                                 0x1
#define _ACTCON_ACTD_MASK                                   0x40
#define _ACTCON_ACTSEL_POSN                                 0x7
#define _ACTCON_ACTSEL_POSITION                             0x7
#define _ACTCON_ACTSEL_SIZE                                 0x1
#define _ACTCON_ACTSEL_LENGTH                               0x1
#define _ACTCON_ACTSEL_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ACTORS                 :1;
        unsigned                        :1;
        unsigned ACTLOCK                :1;
        unsigned ACTSRC                 :1;
        unsigned                        :1;
        unsigned ACTUD                  :1;
        unsigned ACTEN                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned STOR                   :1;
        unsigned                        :1;
        unsigned STLOCK                 :1;
        unsigned STSRC                  :1;
        unsigned                        :1;
        unsigned STUD                   :1;
        unsigned STEN                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned ACTOR                  :1;
        unsigned                        :4;
        unsigned ACTD                   :1;
        unsigned ACTSEL                 :1;
    };
} STCONbits_t;
