MikroElektronika/core_packages/PIC/XC8/def/PIC18F25K50/mcu.h
extern volatile STCONbits_t STCONbits __at(0xFB5);
// bitfield macros
#define _STCON_ACTORS_POSN                                  0x1
#define _STCON_ACTORS_POSITION                              0x1
#define _STCON_ACTORS_SIZE                                  0x1
#define _STCON_ACTORS_LENGTH                                0x1
#define _STCON_ACTORS_MASK                                  0x2
#define _STCON_ACTLOCK_POSN                                 0x3
#define _STCON_ACTLOCK_POSITION                             0x3
#define _STCON_ACTLOCK_SIZE                                 0x1
#define _STCON_ACTLOCK_LENGTH                               0x1
#define _STCON_ACTLOCK_MASK                                 0x8
#define _STCON_ACTSRC_POSN                                  0x4
#define _STCON_ACTSRC_POSITION                              0x4
#define _STCON_ACTSRC_SIZE                                  0x1
#define _STCON_ACTSRC_LENGTH                                0x1
#define _STCON_ACTSRC_MASK                                  0x10
#define _STCON_ACTUD_POSN                                   0x6
#define _STCON_ACTUD_POSITION                               0x6
#define _STCON_ACTUD_SIZE                                   0x1
#define _STCON_ACTUD_LENGTH                                 0x1
#define _STCON_ACTUD_MASK                                   0x40
#define _STCON_ACTEN_POSN                                   0x7
#define _STCON_ACTEN_POSITION                               0x7
#define _STCON_ACTEN_SIZE                                   0x1
#define _STCON_ACTEN_LENGTH                                 0x1
#define _STCON_ACTEN_MASK                                   0x80
#define _STCON_STOR_POSN                                    0x1
#define _STCON_STOR_POSITION                                0x1
#define _STCON_STOR_SIZE                                    0x1
#define _STCON_STOR_LENGTH                                  0x1
#define _STCON_STOR_MASK                                    0x2
#define _STCON_STLOCK_POSN                                  0x3
#define _STCON_STLOCK_POSITION                              0x3
#define _STCON_STLOCK_SIZE                                  0x1
#define _STCON_STLOCK_LENGTH                                0x1
#define _STCON_STLOCK_MASK                                  0x8
#define _STCON_STSRC_POSN                                   0x4
#define _STCON_STSRC_POSITION                               0x4
#define _STCON_STSRC_SIZE                                   0x1
#define _STCON_STSRC_LENGTH                                 0x1
#define _STCON_STSRC_MASK                                   0x10
#define _STCON_STUD_POSN                                    0x6
#define _STCON_STUD_POSITION                                0x6
#define _STCON_STUD_SIZE                                    0x1
#define _STCON_STUD_LENGTH                                  0x1
#define _STCON_STUD_MASK                                    0x40
#define _STCON_STEN_POSN                                    0x7
#define _STCON_STEN_POSITION                                0x7
#define _STCON_STEN_SIZE                                    0x1
#define _STCON_STEN_LENGTH                                  0x1
#define _STCON_STEN_MASK                                    0x80
#define _STCON_ACTOR_POSN                                   0x1
#define _STCON_ACTOR_POSITION                               0x1
#define _STCON_ACTOR_SIZE                                   0x1
#define _STCON_ACTOR_LENGTH                                 0x1
#define _STCON_ACTOR_MASK                                   0x2
#define _STCON_ACTD_POSN                                    0x6
#define _STCON_ACTD_POSITION                                0x6
#define _STCON_ACTD_SIZE                                    0x1
#define _STCON_ACTD_LENGTH                                  0x1
#define _STCON_ACTD_MASK                                    0x40
#define _STCON_ACTSEL_POSN                                  0x7
#define _STCON_ACTSEL_POSITION                              0x7
#define _STCON_ACTSEL_SIZE                                  0x1
#define _STCON_ACTSEL_LENGTH                                0x1
#define _STCON_ACTSEL_MASK                                  0x80

// Register: ECCP1AS
#define ECCP1AS ECCP1AS
extern volatile unsigned char           ECCP1AS             __at(0xFB6);
#ifndef _LIB_BUILD
asm("ECCP1AS equ 0FB6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSS1BD                 :2;
        unsigned PSS1AC                 :2;
        unsigned ECCP1AS                :3;
        unsigned ECCP1ASE               :1;
    };
    struct {
        unsigned PSS1BD0                :1;
        unsigned PSS1BD1                :1;
        unsigned PSS1AC0                :1;
        unsigned PSS1AC1                :1;
        unsigned ECCP1AS0               :1;
        unsigned ECCP1AS1               :1;
        unsigned ECCP1AS2               :1;
        unsigned CCP1ASE                :1;
    };
    struct {
        unsigned P1SSBD                 :2;
        unsigned P1SSAC                 :2;
        unsigned CCP1AS                 :3;
    };
    struct {
        unsigned PSSBD0                 :1;
        unsigned PSSBD1                 :1;
        unsigned PSSAC0                 :1;
        unsigned PSSAC1                 :1;
    };
} ECCP1ASbits_t;
extern volatile ECCP1ASbits_t ECCP1ASbits __at(0xFB6);
// bitfield macros
#define _ECCP1AS_PSS1BD_POSN                                0x0
#define _ECCP1AS_PSS1BD_POSITION                            0x0
#define _ECCP1AS_PSS1BD_SIZE                                0x2
#define _ECCP1AS_PSS1BD_LENGTH                              0x2
#define _ECCP1AS_PSS1BD_MASK                                0x3
#define _ECCP1AS_PSS1AC_POSN                                0x2
#define _ECCP1AS_PSS1AC_POSITION                            0x2
#define _ECCP1AS_PSS1AC_SIZE                                0x2
#define _ECCP1AS_PSS1AC_LENGTH                              0x2
#define _ECCP1AS_PSS1AC_MASK                                0xC
#define _ECCP1AS_ECCP1AS_POSN                               0x4
#define _ECCP1AS_ECCP1AS_POSITION                           0x4
#define _ECCP1AS_ECCP1AS_SIZE                               0x3
#define _ECCP1AS_ECCP1AS_LENGTH                             0x3
#define _ECCP1AS_ECCP1AS_MASK                               0x70
#define _ECCP1AS_ECCP1ASE_POSN                              0x7
#define _ECCP1AS_ECCP1ASE_POSITION                          0x7
#define _ECCP1AS_ECCP1ASE_SIZE                              0x1
#define _ECCP1AS_ECCP1ASE_LENGTH                            0x1
#define _ECCP1AS_ECCP1ASE_MASK                              0x80
#define _ECCP1AS_PSS1BD0_POSN                               0x0
#define _ECCP1AS_PSS1BD0_POSITION                           0x0
#define _ECCP1AS_PSS1BD0_SIZE                               0x1
#define _ECCP1AS_PSS1BD0_LENGTH                             0x1
#define _ECCP1AS_PSS1BD0_MASK                               0x1
#define _ECCP1AS_PSS1BD1_POSN                               0x1
#define _ECCP1AS_PSS1BD1_POSITION                           0x1
#define _ECCP1AS_PSS1BD1_SIZE                               0x1
#define _ECCP1AS_PSS1BD1_LENGTH                             0x1
#define _ECCP1AS_PSS1BD1_MASK                               0x2
#define _ECCP1AS_PSS1AC0_POSN                               0x2
#define _ECCP1AS_PSS1AC0_POSITION                           0x2
#define _ECCP1AS_PSS1AC0_SIZE                               0x1
#define _ECCP1AS_PSS1AC0_LENGTH                             0x1
#define _ECCP1AS_PSS1AC0_MASK                               0x4
#define _ECCP1AS_PSS1AC1_POSN                               0x3
#define _ECCP1AS_PSS1AC1_POSITION                           0x3
#define _ECCP1AS_PSS1AC1_SIZE                               0x1
#define _ECCP1AS_PSS1AC1_LENGTH                             0x1
#define _ECCP1AS_PSS1AC1_MASK                               0x8
#define _ECCP1AS_ECCP1AS0_POSN                              0x4
#define _ECCP1AS_ECCP1AS0_POSITION                          0x4
#define _ECCP1AS_ECCP1AS0_SIZE                              0x1
#define _ECCP1AS_ECCP1AS0_LENGTH                            0x1
#define _ECCP1AS_ECCP1AS0_MASK                              0x10
#define _ECCP1AS_ECCP1AS1_POSN                              0x5
#define _ECCP1AS_ECCP1AS1_POSITION                          0x5
#define _ECCP1AS_ECCP1AS1_SIZE                              0x1
#define _ECCP1AS_ECCP1AS1_LENGTH                            0x1
#define _ECCP1AS_ECCP1AS1_MASK                              0x20
#define _ECCP1AS_ECCP1AS2_POSN                              0x6
#define _ECCP1AS_ECCP1AS2_POSITION                          0x6
#define _ECCP1AS_ECCP1AS2_SIZE                              0x1
#define _ECCP1AS_ECCP1AS2_LENGTH                            0x1
#define _ECCP1AS_ECCP1AS2_MASK                              0x40
#define _ECCP1AS_CCP1ASE_POSN                               0x7
#define _ECCP1AS_CCP1ASE_POSITION                           0x7
#define _ECCP1AS_CCP1ASE_SIZE                               0x1
#define _ECCP1AS_CCP1ASE_LENGTH                             0x1
#define _ECCP1AS_CCP1ASE_MASK                               0x80
#define _ECCP1AS_P1SSBD_POSN                                0x0
#define _ECCP1AS_P1SSBD_POSITION                            0x0
#define _ECCP1AS_P1SSBD_SIZE                                0x2
#define _ECCP1AS_P1SSBD_LENGTH                              0x2
#define _ECCP1AS_P1SSBD_MASK                                0x3
#define _ECCP1AS_P1SSAC_POSN                                0x2
#define _ECCP1AS_P1SSAC_POSITION                            0x2
#define _ECCP1AS_P1SSAC_SIZE                                0x2
#define _ECCP1AS_P1SSAC_LENGTH                              0x2
#define _ECCP1AS_P1SSAC_MASK                                0xC
#define _ECCP1AS_CCP1AS_POSN                                0x4
#define _ECCP1AS_CCP1AS_POSITION                            0x4
#define _ECCP1AS_CCP1AS_SIZE                                0x3
#define _ECCP1AS_CCP1AS_LENGTH                              0x3
#define _ECCP1AS_CCP1AS_MASK                                0x70
#define _ECCP1AS_PSSBD0_POSN                                0x0
#define _ECCP1AS_PSSBD0_POSITION                            0x0
#define _ECCP1AS_PSSBD0_SIZE                                0x1
#define _ECCP1AS_PSSBD0_LENGTH                              0x1
#define _ECCP1AS_PSSBD0_MASK                                0x1
#define _ECCP1AS_PSSBD1_POSN                                0x1
#define _ECCP1AS_PSSBD1_POSITION                            0x1
#define _ECCP1AS_PSSBD1_SIZE                                0x1
#define _ECCP1AS_PSSBD1_LENGTH                              0x1
#define _ECCP1AS_PSSBD1_MASK                                0x2
#define _ECCP1AS_PSSAC0_POSN                                0x2
#define _ECCP1AS_PSSAC0_POSITION                            0x2
#define _ECCP1AS_PSSAC0_SIZE                                0x1
#define _ECCP1AS_PSSAC0_LENGTH                              0x1
#define _ECCP1AS_PSSAC0_MASK                                0x4
#define _ECCP1AS_PSSAC1_POSN                                0x3
#define _ECCP1AS_PSSAC1_POSITION                            0x3
#define _ECCP1AS_PSSAC1_SIZE                                0x1
#define _ECCP1AS_PSSAC1_LENGTH                              0x1
#define _ECCP1AS_PSSAC1_MASK                                0x8

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             __at(0xFB7);
#ifndef _LIB_BUILD
asm("PWM1CON equ 0FB7h");
#endif
// aliases
extern volatile unsigned char           ECCP1DEL            __at(0xFB7);
#ifndef _LIB_BUILD
asm("ECCP1DEL equ 0FB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1DC                   :7;
        unsigned P1RSEN                 :1;
    };
    struct {
        unsigned PDC0                   :1;
        unsigned PDC1                   :1;
        unsigned PDC2                   :1;
        unsigned PDC3                   :1;
        unsigned PDC4                   :1;
        unsigned PDC5                   :1;
        unsigned PDC6                   :1;
        unsigned PR1SEN                 :1;
    };
} PWM1CONbits_t;
